DataProcessors/ЗагрузкаПлатежныхПоручений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаПлатежныхПоручений</Name>
			<Comment>Загрузка платежных поручений из бухгалтерии</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РезультатыВыполненияОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РезультатыВыполненияОбработок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Успешный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщенияОбОшибках</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЗагрузкаПлатежныхПоручений/Ext/ManagerModule.bsl
Процедура ЗапуститьЗагрузку() Экспорт 
	
	КлючОбработки			= "Загрузка Платежных поручений";
	ИдентификаторОбработки	= "ЗагрузкаПлатежныхПоручений";		
	
	СтруктруаЗаписиРезультатаВыполнения = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
	СтруктруаЗаписиРезультатаВыполнения.ИдентификаторОбработки = ИдентификаторОбработки;
	СтруктруаЗаписиРезультатаВыполнения.КлючОбработки = КлючОбработки;
	РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Начало обработки.", СтруктруаЗаписиРезультатаВыполнения);
	
	Попытка
		Определение = Новый WSОпределения("https://orders-1c.digma.ua/Buh/cwd2.1cws?wsdl",,,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
		WS = Новый WSПрокси(Определение,"http://www.digma.ua", "CommunicationWithDatabases", "CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
	Исключение 
		ОшибкиИнициализации = ОписаниеОшибки();
		
		ОбщегоНазначения.СообщитьПользователю(ОшибкиИнициализации);
		
		КодСостояния = "ОбработкаОбмена.ИнициализацияОбработки - Не удалось подключится к базе: " + КлючОбработки;						
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("КодСостояния	"+КодСостояния, СтруктруаЗаписиРезультатаВыполнения);
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание		"+ОшибкиИнициализации, СтруктруаЗаписиРезультатаВыполнения);												
		РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Ложь);
		
		Возврат;
	КонецПопытки;
	
	//Правило = ПолучитьМакет("Правило").ПолучитьТекст();
	//ХранилищеДанных = Новый ХранилищеЗначения(Правило, Новый СжатиеДанных(9));	

	ХранилищеДанных = ОбменДаннымиПереопределяемый.ПравилаКонвертацииОбъектов("ОбменБухгалтерия", Истина);
	
	ВсеОК = Истина;	
	Description = "";
	
	ПараметрПродолжитьЗагрузку = Ложь;
	
	ЗначенияПараметров = Новый Структура("ДатаГраница,КодУзлаОбмена", Дата(2021,11,1), "SSL");
	ЗначенияПараметровXDTO = СериализаторXDTO.ЗаписатьXDTO(ЗначенияПараметров);
	
	//резРег = WS.RegDoc("ОбменБанкТК");
	//Если Не резРег Тогда
	//	РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Ошибка регистрации", СтруктруаЗаписиРезультатаВыполнения);	
	//	Возврат;
	//КонецЕсли;
	
	
	ДанныеЗагрузки = WS.ОтдатьДанные(ХранилищеДанных, ЗначенияПараметровXDTO, ПараметрПродолжитьЗагрузку, Истина);					
	
	Рез = ТК_ОбменДаннымиСервер.ВыполнитьЗагрузкуЧерезУниверсальныйОбменXML("ПлатежныеПоручения",ИдентификаторОбработки,ДанныеЗагрузки);
	
	ВсеОК = Рез.Success;
	Description = Рез.Description;
	
	Если ЗначениеЗаполнено(Description) Тогда 
		РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий(Description, СтруктруаЗаписиРезультатаВыполнения);
	КонецЕсли;
	
	Если ВсеОК Тогда
		резДел = WS.DelRegDoc("ОбменБанкТК");
		Если Не резДел Тогда
			РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Ошибка удаление регистрации", СтруктруаЗаписиРезультатаВыполнения);	
			Возврат;
		Иначе
			РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Конец обработки.", СтруктруаЗаписиРезультатаВыполнения);
		КонецЕсли;
	Иначе
		резРег = WS.RegDoc("ОбменБанкТК");
		Если Не резРег Тогда
			РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Ошибка регистрации", СтруктруаЗаписиРезультатаВыполнения);	
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ВсеОК Тогда		
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание "+Description, СтруктруаЗаписиРезультатаВыполнения);	
	КонецЕсли;
	
	РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, ВсеОк);
	
КонецПроцедуры
